Revit 2026 API
IFCCategoryTemplate.SetActiveTemplate Method
Overload List
Name | Description
SetActiveTemplate() |  Sets the mapping template element to be the active mapping template for its document.
SetActiveTemplate(Document) | Obsolete.
 Sets the mapping template element to be the active mapping template in the document.
Top
See Also
Reference
IFCCategoryTemplate Class
Autodesk.Revit.DB Namespace